[Killed] BlockStatement
src/lib/counter-lib/counter-lib.ts:12:15
 export class CounterLibComponent {
   count = 0;
 
-  increment() {
-    this.count++;
-  }
+  increment() {}
 
   decrement() {
killedBy: All tests
statusReason: FAIL counter-lib libs/counter-lib/src/lib/counter-lib/counter-lib.spec.ts

  CounterLibComponent

    ✕ должен увеличивать значение на 1 (30 ms)

[Killed] UpdateOperator
src/lib/counter-lib/counter-lib.ts:13:5
   count = 0;
 
   increment() {
-    this.count++;
+    this.count--;
   }
 
killedBy: All tests
statusReason: FAIL counter-lib libs/counter-lib/src/lib/counter-lib/counter-lib.spec.ts

  CounterLibComponent

    ✕ должен увеличивать значение на 1 (29 ms)


  ● CounterLibComponent › должен увеличивать значение на 1

[Survived] BlockStatement
src/lib/counter-lib/counter-lib.ts:16:15
     this.count++;
   }
 
-  decrement() {
-    this.count--;
-  }
+  decrement() {}
 }
 

[Survived] UpdateOperator
src/lib/counter-lib/counter-lib.ts:17:5
   }
 
   decrement() {
-    this.count--;
+    this.count++;
   }
 }
